<a href="https://colab.research.google.com/github/laraibanza/Data-Analysis/blob/main/Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Analysis with Python

# Lecture 1

#Types Of Data Analysis
Descriptive : "What happened?"

Diagnostic : "Why did it happen?"

Predictive : "What will happen next?"

Prescriptive : "How can we make something happen?"

In [10]:
import pandas as pd

from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [34]:
# Dataframe  and series in Pandas

City_Names= pd.Series(["Pakistan","Turkey", "USA","UAE","Namibia"])
Continent_Names=pd.Series(["Asia","Europe","North America","Antarctica","Africa"])
pd.DataFrame({'Names': City_Names,
              'Continent': Continent_Names ,
             'Num' : [3,12,20,38,49]})

      Names      Continent  Num
0  Pakistan           Asia    3
1    Turkey         Europe   12
2       USA  North America   20
3       UAE     Antarctica   38
4   Namibia         Africa   49

In [33]:
Data=pd.Series(["Sgd","Karachi","Lahore","Islamabad"] , index= ['a','b','c','d'])
print(Data)

a          Sgd
b      Karachi
c       Lahore
d    Islamabad
dtype: object

In [22]:
City_Names.to_frame()

          0
0  Pakistan
1    Turkey
2       USA
3       UAE
4   Namibia